# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [13]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [14]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
df = pd.read_csv(url, sep=',')

### Step 4. See the first 10 entries

In [15]:
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [16]:
df.drop(['Unnamed: 0', 'Id'], axis=1)

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [23]:
df['Gender']. value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [28]:
names = df.groupby("Name").sum()
names

         Unnamed: 0         Id    Year  Count
Name
Aaban       7733801    7733803    4027     12
Aadan       7158061    7158065    8039     23
Aadarsh     1728030    1728031    2009      5
Aaden     555052029  555052225  393963   3426
Aadhav       709606     709607    2014      6
...             ...        ...     ...    ...
Zyra       17538998   17539005   14085     42
Zyrah       5487073    5487075    4024     11
Zyren       5074229    5074230    2013      6
Zyria      29787029   29787039   20089     59
Zyriah     34146196   34146205   18087     58

[17632 rows x 4 columns]

### Step 8. How many different names exist in the dataset?

###me he estado peleando con esta porque no conseguía sacar los valores unicos, pero en realidad, como los he agrupado y sumado en la anterior, no me hacía falta, porque ya tengo los valores unicos

In [35]:
len (names)

17632

### Step 9. What is the name with most occurrences?

In [41]:
names.sort_values(by = 'Count', ascending = False)

            Unnamed: 0          Id     Year   Count
Name
Jacob       1665680788  1665681356  1141099  242874
Emma        1629481684  1629482250  1137085  214852
Michael     1687520717  1687521295  1161152  214405
Ethan       1660807908  1660808475  1139091  209277
Isabella    1630131220  1630131786  1137090  204798
...                ...         ...      ...     ...
Eniola         4930125     4930126     2012       5
Atlantis       4904426     4904427     2005       5
Marci          4901272     4901273     2004       5
Simarpreet      553385      553386     2011       5
Nita            536781      536782     2007       5

[17632 rows x 4 columns]

### Step 10 [__]. How many different names have the least occurrences?

In [50]:
##he probado a usar sort values sobre count, pero no me da el numero exacto. con la funcion min, no me da todos los que son el minimo

### Step 11. What is the median name occurrence?

In [43]:
names.loc[:,"Count"].median()

49.0

### Step 12. What is the standard deviation of names?

In [45]:
names.loc[:,"Count"].std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [47]:
names.describe()

         Unnamed: 0            Id          Year          Count
count  1.763200e+04  1.763200e+04  1.763200e+04   17632.000000
mean   1.631922e+08  1.631922e+08  1.158117e+05    2008.932169
std    3.504512e+08  3.504513e+08  2.451618e+05   11006.069468
min    8.606400e+04  8.606500e+04  2.004000e+03       5.000000
25%    4.918374e+06  4.918375e+06  4.017000e+03      11.000000
50%    1.963462e+07  1.963463e+07  1.606100e+04      49.000000
75%    1.071826e+08  1.071826e+08  7.846425e+04     337.000000
max    3.223035e+09  3.223036e+09  2.233993e+06  242874.000000